[
  {
    "url":"https:\/\/www.madewithnestle.ca\/",
    "title":"Nestlé Brands' Products, Recipes and News | Made With Nestlé Canada",
    "text":"Learn about our commitment to sustainable cocoa farming practices. Learn about our commitment to sustainable cocoa farming practices. Learn about our commitment to sustainable cocoa farming practices. Introducing BOOST® Kids – a line of nutritional supplements formulated for kids aged 4-12! Introducing BOOST® Kids – a line of nutritional supplements formulated for kids aged 4-12! Introducing BOOST® Kids – a line of nutritional supplements formulated for kids aged 4-12! Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. In the spirit of celebrating diversity in Canada, we’re sharing some of our favourite recipes from around the globe. Because nothing connects us more than sharing food together. In the spirit of celebrating diversity in Canada, we’re sharing some of our favourite recipes from around the globe. Because nothing connects us more than sharing food together. In the spirit of celebrating diversity in Canada, we’re sharing some of our favourite recipes from around the globe. Because nothing connects us more than sharing food together. Learn about our commitment to sustainable cocoa farming practices. Learn about our commitment to sustainable cocoa farming practices. Learn about our commitment to sustainable cocoa farming practices. Introducing BOOST® Kids – a line of nutritional supplements formulated for kids aged 4-12! Introducing BOOST® Kids – a line of nutritional supplements formulated for kids aged 4-12! Introducing BOOST® Kids – a line of nutritional supplements formulated for kids aged 4-12! Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. In the spirit of celebrating diversity in Canada, we’re sharing some of our favourite recipes from around the globe. Because nothing connects us more than sharing food together. In the spirit of celebrating diversity in Canada, we’re sharing some of our favourite recipes from around the globe. Because nothing connects us more than sharing food together. In the spirit of celebrating diversity in Canada, we’re sharing some of our favourite recipes from around the globe. Because nothing connects us more than sharing food together. Learn about our commitment to sustainable cocoa farming practices. Learn about our commitment to sustainable cocoa farming practices. Learn about our commitment to sustainable cocoa farming practices. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/aero",
    "title":"AERO | Feel the Bubbles Melt | Nestlé Canada",
    "text":"Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. Enter for a chance to WIN headphones or Spotify Premium, so you can bubble to your own beat all day long. Fact:The light, airy bubbles in AERO make the world’s meltiest s’mores. And we made an entire channel about it. Fall and bubbly hot chocolate are so mint to be, don’t you think? 5 mins. 5 mins. The AERO milk chocolate inside these delicious brownies gives it the effect of having the icing on the inside. 20 mins. 37 mins. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/coffee-crisp",
    "title":"COFFEE CRISP | Makes a Nice Light Snack!",
    "text":"Wake up your taste buds with the perfect blend of crispy wafer & coffee crème covered in a thin chocolatey coating. Wake up your taste buds with the perfect blend of crispy wafer & coffee crème covered in a thin chocolatey coating. COFFEE CRISP POPsYour favorite nice light snack of thin chocolatey coating, coffeecrème, and layers of light crispy wafers. A new take on a classic cake. There's no better way to…celebrate than with this delicious birthday cake recipe. A COFFEE CRISP lover's dream! 0 mins. 60 mins. What better way to say cheers for Canada’s 150th…than with your favourite Canadian wafer bar? Wow your guests with this quick and easy recipe! 4 mins. 0 mins. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/kit-kat",
    "title":"KITKAT | Have a Break | Made with Nestlé Canada",
    "text":"These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/smarties",
    "title":"SMARTIES | How Do You Smarties?",
    "text":"Whether you shake, sort, or make your own creation, every box of SMARTIES is a moment of colourful fun! Whether you shake, sort, or make your own creation, every box of SMARTIES is a moment of colourful fun! You'll go bananas for this bite size treat! 8 mins. 2 mins. Did you know that SMARTIES are a Canadian-centered…confectionery product? Try these yummy, chocolatey Canadian Cookies! A treat kids of all ages will love. 15 mins. 9 mins. No fish are harmed in the making of THIS sushi! 18 mins. 2 mins. A playful creation perfect for colourful celebrations! 10 mins. 16 mins. Hi! My name's Yum-o-tronic 3000. 1 mins. 2 mins. Candy-coat your fun with this special SMARTIES Stop Sign! 15 mins. 0 mins. A sweet and salty way to say ‘Happy Valentine’s Day’.…Just one is enough to melt your heart! 4 mins. 5 mins. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/turtles",
    "title":"TURTLES | A Canadian Favourite Since 1949",
    "text":"When TURTLES met Strawberry. 10 mins. 5 mins. Good luck eating this one slowly. 25 mins. 45 mins. Treat the family to delicious TURTLES baked apples,…and everyone will be thankful for YOU! 10 mins. 40 mins. Find out what happens when TURTLES meets a mousse! 15 mins. 0 mins. TURTLES and cheesecake are match made in heaven. 20 mins. 45 mins. When you combine two holiday favourites, do you…get a favourite, favourite? 10 mins. 10 mins. Move over apple fritters! These batter-coated…TURTLES dusted with icing sugar are just like a day at the fair! 10 mins. 10 mins. We're lovin' the 'no oven' for this creation (more time to…bask in sweet & salty bliss). 5 mins. 5 mins. Kick back and relax with your favourite movie and…TURTLES Popcorn 10 mins. 0 mins. TURTLES and spice and everything nice. 10 mins. 40 mins. If you didn’t have them at hello, you definitely will at…TURTLES. 10 mins. 0 mins. Just add bonfire! 4 mins. 5 mins. Layer on the love with an indulgent treat that’s…guaranteed to leave the whole family wanting s’more! 4 mins. 1 mins. There’s cupcakes, and then there’s surprise cupcakes!…With whole TURTLES baked into fluffy cake, these delicious treats are sure to surprise and delight. 10 mins. 20 mins. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/after-eight",
    "title":"AFTER EIGHT | Timeless. Deliciousness - madewithnestle.ca",
    "text":"AFTER EIGHT’s refreshing indulgence is the perfect ending to any evening! AFTER EIGHT’s refreshing indulgence is the perfect ending to any evening! So many ways (and reasons) to celebrate These irresistible mint brownies are the perfect after dinner dessert! 15 mins. 35 mins. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/big-turk",
    "title":"Complementary Brands | A perfect bar for every chocolate lover!",
    "text":"With a collection of delicious bars in a variety of textures and tastes, it’s easy to find your match made in heaven. With a collection of delicious bars in a variety of textures and tastes, it’s easy to find your match made in heaven.  We measure our environmental impact.See how we're doing These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/crunch",
    "title":"Complementary Brands | A perfect bar for every chocolate lover!",
    "text":"With a collection of delicious bars in a variety of textures and tastes, it’s easy to find your match made in heaven. With a collection of delicious bars in a variety of textures and tastes, it’s easy to find your match made in heaven.  We measure our environmental impact.See how we're doing These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/drumstick-bites",
    "title":"Drumstick bites | Made with nestle",
    "text":"These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/easter-holiday",
    "title":"Easter chocolates and treats | Made With Nestlé Canada",
    "text":"Join us at the Toronto Beach Easter Egg Scavenger Hunt on April 18, 2025, or the Easter Parade on April 20, 2025. Our team will be giving away samples again at this event. Hope to see you there!  LEARN MORE Hop into the Easter fun with KitKat! Enjoy a delicious KitKat bunny with a Smarties infused chocolate muffin. You won't…need an excuse to have more than one break! 15 mins. 25 mins. Stop the hunt! We have found the perfect Easter egg recipe for everyone in the family to enjoy! Hop on board with KitKat…bunnies and Smarties eggs for a delicious treat you won't want to miss! 20 mins. 20 mins. Take a big break this Easter while enjoying a slice of KitKat bunny Carrot Cake! 20 mins. 50 mins. Smooth, creamy, and decadent... these are just SOME of the amazing descriptors for out KitKat Coconut mousse. If you're…looking for something new to try this Easter, you've found it. 15 mins. 0 mins. Step up your Easter game with this fun and challenging quest for the children. 60 mins. 0 mins. SMARTIES Fruit n' Nut Bars are perfect egg hunt fuel 5 mins. 15 mins. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/mackintosh-toffee",
    "title":"Mackintosh Caramel | MACK is back!",
    "text":"MACKINTOSH toffee is back, and just as delicious as you remember! Our creamy toffee has been enjoyed for over 100 years. MACKINTOSH toffee is back, and just as delicious as you remember! Our creamy toffee has been enjoyed for over 100 years. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/mirage",
    "title":"Complementary Brands | A perfect bar for every chocolate lover!",
    "text":"With a collection of delicious bars in a variety of textures and tastes, it’s easy to find your match made in heaven. With a collection of delicious bars in a variety of textures and tastes, it’s easy to find your match made in heaven.  We measure our environmental impact.See how we're doing These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/quality-street",
    "title":"QUALITY STREET | Imported Chocolates & Caramels",
    "text":"Celebrate with a tin full of tradition. QUALITY STREET is a decadent mix of imported chocolates and caramels that will delight your friends and family. Celebrate with a tin full of tradition. QUALITY STREET is a decadent mix of imported chocolates and caramels that will delight your friends and family. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/rolo",
    "title":"New ROLO Peanut Butter: a hit of chocolate with delicious peanut",
    "text":"Sharing your last delicious piece will be next to impossible. Sharing your last delicious piece will be next to impossible. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/coffee-mate",
    "title":"COFFEE-MATE | Make Every Coffee a Rich & Creamy Coffee",
    "text":"These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/nescafe",
    "title":"Nescafé Gold Espresso | madewithnestle.ca",
    "text":"With a range of flavours and intensities to choose from, there's a NESCAFÉ to suit everyone. The perfect cup that’s been waking up with Canadians for over 75 years. The intensity you want, crafted with care for the moments that matter. You are never more than a moment away from a pick me up in a cup. Delivering a smooth taste and rich aroma in an instant, since 1966. How Nescafé is helping coffee farms be more resilient to the impact of climate change. Become a member today and get even closer to the brands you love. Discover exclusive coupons, contests, giveaways and more! Follow us on our social media accounts to get even more tasty content. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/confectionery-frozen-desserts",
    "title":"Ice Cream and Frozen Desserts | Nestlé Canada",
    "text":"Our frozen treats are made with good ingredients, and delightful sweets. Our frozen treats are made with good ingredients, and delightful sweets."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/hd-en",
    "title":"HÄAGEN-DAZS Ice Cream | Proudly Made in Canada",
    "text":"It's Dazs like never before. A new plant-based, vegan treat made with oats that takes creaminess to the next level. Indulge in the rich, creamy goodness of Chocolate, Vanilla, and Coffee in our new large size tubs. Perfect for sharing or savouring solo. Plus, discover our 15+ other delectable classic flavours. Pure, simple, and irresistibly creamy. Feel the love in every layer. Iconic ice cream, smooth sauce and crispy layers in every bite. Experience a new level of indulgence. Decadent creations packed with rich ripples and delectable pieces. What makes us who we are    @HAAGENDASZCA"
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/drumstick",
    "title":"DRUMSTICK Sundae Cones | Treat Yourself!",
    "text":"Experience your favourite DRUMSTICK reimagined with exciting new coatings and flavours. The iconic Sundae cone experience, now loaded in a tub! Our full-size DRUMSTICK available in a family of flavours. All the DRUMSTICK indulgence, in a mini size treat. Your favourite cone in a delicious plant-based treat. We’ve been creating joyful memories since 1928. That’s a lot of DRUMSTICK memories."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/del-monte-frozen-desserts",
    "title":"DEL MONTE Real Fruit Frozen Bars",
    "text":"These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/parlour",
    "title":"Nestle parlor ice cream - Frozen Desserts | A Favoutire for Everyone",
    "text":"With frozen desserts, bars, sandwiches, minis, and single serve treats, PARLOUR has a favourite for everyone! With frozen desserts, bars, sandwiches, minis, and single serve treats, PARLOUR has a favourite for everyone!  What’s your favourite scoop? These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/real-dairy",
    "title":"Nestlé REAL DAIRY Ice Cream | Crafted in Canada",
    "text":"We have a simple approach to creating our delicious ice cream and frozen Greek Yogourt:  to use only quality ingredients. We have a simple approach to creating our delicious ice cream and frozen Greek Yogourt:  to use only quality ingredients.     These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/nestl%C3%A9-materna",
    "title":"Materna Prenatal Supplements | Nestlé Baby & me",
    "text":"Need Help? Search About Nestlé Baby & me Stages Your child's development, every step of the way. Topics Find advice and answers to some of parenthood's biggest questions. Brands Explore nutritional brands that support you and your child’s overall growth and development. Products Discover our best nutritional offerings for you and your little one. Tools Enjoy all our parenting tools in one place. Quiz Join us Country - Language #1 DOCTOR RECOMMENDED* BRAND OF PRENATAL MULTIVITAMINS** Becoming a mom is life’s biggest adventure. From preconception through pregnancy to after birth and breastfeeding, everything you do today can positively impact your baby’s lifelong health. As the #1 brand in Prenatal Multivitamins* and the #1 doctor recommended brand, we want to give you and your baby only the best, our products are crafted by the latest science and inspired by our deep understanding of maternal needs. Our ambition is to provide the best prenatal vitamins for your health at every stage of motherhood - when trying to conceive, during pregnancy, post pregnancy and\/or during breastfeeding. *Claim based on IQVIA L52W period ending in Dec 2023. #1 Prenatal Multivitamin brand in Canada* #1 Doctor Recommended** Contains 100% Daily Folic Acid & Vitamin D*** Non-GMO & Vegetarian**** Materna®Prenatal | Multivitamins+DHA | Tablet + Softgel With 100% of the recommended daily folic acid and Vitamin. Contains DHA to help support cognitive and brain … and more! Materna®Prenatal | Multivitamins+DHA | Gummies With Folic acid to help reduce risk of neural tube defects*. Contains DHA to help support cognitive and brain function … and more! Materna®Prenatal | Multivitamins | Tablets With 100% of the recommended daily folic acid and Vitamin D. Helps support early fetal development. Helps … and more! Trending articles Prenatal multivitamins and folic acid for pregnancy A lack of folic acid during pregnancy leads to higher risk of neural tube defects in the baby. Learn about supplementing with folic acid and how much you need. 4 mins to read A Good Pre-Conception, Pregnancy, and Post-Pregnancy Diet Even before you conceive, every bite counts. Wait, that’s a lot to consider, right? Don’t worry, this healthy eating breakdown serves up diet information that will matter to you. 6 mins to read Gestational diabetes symptoms 10 essential questions about gestational diabetes answered 6 mins to read Healthy pregnancy diet: What to eat and avoid A healthy, well-balanced diet is beneficial for you and the baby growing in your belly, but some nutrients are critical for the healthy growth and development of your baby. 8 mins to read How to exercise safely through pregnancy Why 30 minutes a day can impact a lifetime. 4 mins to read Footnotes *Claim based on Nielsen MarketTrack L52W period ending October 9 2021 for National Grocery, Drug, Mass Merchandisers. **Over-the-counter prenatal multivitamin brand. Provoice research 2020. Data on file ‡LC40TMis distributed under license by Biosearch S.A. 1Hurtado JA et al. (2017) Oral Administration to Nursing Women of Lactobacillus fermentum CECT5716 Prevents Lactational Mastitis Development: A Randomized Controlled Trial. Breastfeeding Medicine. 12(4):202-09. 2Maldonado-Lobòn JA et al. (2015) Lactobacillus fermentum CECT5716 Reduced Staphylococcus Load in the Breastmilk of Lactating Mothers Suffering Breast Pain: A Randomized Controlled Trial. Breastfeeding Medicine. 10(9):425-32. 3Arroyo R et al. (2010) Treatment of Infectious Mastitis during Lactation: Antibiotic versus Oral Administration of Lactobacilli Isolated from Breast Milk. Clinical Infectious Disease. 50(12):1551-1558. Eat today for their tomorrow. Each daily tablet of Materna®contains folic acid to help prevent neural tube defects, and 22 essential vitamins and minerals to support you during your pregnancy. Join Your parenting instincts, our support SIGN UP & GET A CHANCE TO WIN Sign up for Nestlé Baby & me and automatically be entered for a chance to win a $100* gift card! For full details, please visit theTerms & Conditions. PERSONALIZED EMAILS & SUPPORT Receive customized emails with useful info, special offers, & more to help guide you through each parenting phase. HELPFUL TOOLS & RESOURCES Get access to our helpful and interactive parenting tools & resources in one convenient hub. EXPERT GUIDANCE We offer science-based advice & specialized nutritional guidance for every stage of the parenting journey—from preconception to toddlerhood. Still haven't found what you are looking for? Enjoy experts advice, exclusive offers and more! Discover your tailored content. Define your interests and access to your personalized contents page. Looking for inspiration on what to feed your little one? These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/maggi",
    "title":"MAGGI Seasoning Mix | The Secret Behind Your Most Delicious Dishes",
    "text":"MAGGI’s high quality ingredients and time-tested recipes make it quick and simple to create the perfect dish. MAGGI’s high quality ingredients and time-tested recipes make it quick and simple to create the perfect dish. We measure our environmental impact.See how we're doing A deliciously different way to prepare sabzi, our Subz…Mast Masala makes dinner prep easy, thanks to MAGGI Tamarina Sauce and MAGGI Masala Chilli Sauce. You don’t have to add any masalas, just add your favourite vegetables to this spicy roasted medley and watch your family savour this vegetarian dish that is crispy, tasty, and mast all at once! 15 mins. 30 mins. Biryani or your favourite MAGGI Masala Noodles?…Now you don't have to choose. This epic MAGGI Noodles Biryani Recipe combines your favourite 2-Minute Masala Noodles with a Biryani twist. Packed with lots of vegetables and aromatic spices, this easy and delicious meal will be a hit with the whole family. It can be served at home for everyday cooking or for special occasions like holidays and celebrations. 15 mins. 40 mins. A classic throughout the Caribbean but famously…known as a Jamaican staple, this beloved style of barbecue finds its roots from the Spanish term charqui, which means “dried strips of meat” and is reflective of the jerky-style texture and smoky flavour of meats cooked over burning coals. 15 mins. 35 mins. Looking for a quick and easy Maggi Egg Recipe? Look no…further than our Egg Bhurji recipe! This classic and simple dish takes scrambled eggs to a whole new level of deliciousness. With just 8 simple ingredients, you can whip up a delicious meal that combines the goodness of scrambled eggs with the convenience of Maggi 2 minute noodles. In just a few minutes, you'll have a hearty, satisfying and comforting dinner. Grab your favourite pack of MAGGI Masala Noodles and get cooking. 10 mins. 20 mins. “Three Sisters” refers to the main ingredients used by…the Mohawk, Oneida, Onodaga, Cayuga, Seneca and  Tuscarora First Nations. This hearty, delicious meal is comprised primarily of – corn, beans, and squash – and the traditional methods used to cultivate these crops in a sustainable and productive way. This balanced soup is packed with healthy carbs, protein, and fibre, and is a culinary celebration of Indigenous cultures. 20 mins. 35 mins. A delicious way to break your fast at Iftar, this easy recipe…comes together very quickly and tastes great with warm naan! 10 mins. 8 mins. Surprise your family with your culinary skills by…making this light meal, Maggi Cream Super Soup with broccoli, cauliflower and spinach. In addition to the creamy taste, Maggi Cream Super Soup is enriched with vitamin C - just another reason to have this soup on your table every day! "
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/boost\/boost-kids",
    "title":"BOOST kids | Made with nestle",
    "text":"Introducing BOOST® Kids – a line of nutritional supplements formulated for kids aged 4-12! BOOST® Kids Essentials and BOOST® Kids Fruit Essentials contain8g protein, 2g fibre and 26 vitamins & mineralsper 237ml serving. They have no artificial flavours or colours, with BOOST® Kids Fruit essentials containingreal fruit puree! Their ready-to-drink format make them a great, nutritious option when on the go, in school lunch boxes, or even as a meal! Who says nutrition needs to be complicated?Keep things simple with products that work as hard as you do. Join the BOOST® community to stay up-to-date with new products, discounts and more!  These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/boost",
    "title":"BOOST Nutritional Drinks | Nestlé Canada",
    "text":"Who says nutrition needs to be complicated?Keep things simple with products that work as hard as you do. BOOST® Nutritional Drinks have the nutrients your body needs, and a taste you’ll love. Learn how much protein you need with a our quick, 2-minute quiz The amount of protein you need depends on a number of factors including: For over 20 years, BOOST® has been committed to delivering balanced nutrition to Canadians. In line with this commitment, BOOST® is also dedicated to making strides towards a better tomorrow. Bluefolder Tara Low Kerri1990 Chevette420 Denikea Bluefolder Tara Low Kerri1990 Chevette420 Denikea Bluefolder Join the BOOST® community to stay up-to-date with new products, discounts and more! All trademarks are owned by Société des Produits Nestlé S.A., Vevey, Switzerland and used under license. ©2018 Nestlé These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/goodhost",
    "title":"GOOD HOST Iced Tea & Lemonade | Refreshingly Good",
    "text":"Mix up a delicious sip of summer with GOOD HOST. Mix up a delicious sip of summer with GOOD HOST. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/milo",
    "title":"MILO | The World’s Leading Chocolate Malt Beverage",
    "text":"MILO provides great taste, along with energy, vitamins and minerals for the maintenance of good health. MILO provides great taste, along with energy, vitamins and minerals for the maintenance of good health. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/nestea",
    "title":"NESTEA | The Official Drink of Summer",
    "text":"Refuelling with water has never tasted better.Refresh with delicious NESTEA. Refuelling with water has never tasted better.Refresh with delicious NESTEA.  These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/nesfruta",
    "title":"Nesfruta Water Enhancer | Real fruit flavour at your fingertips",
    "text":"Add a splash of real fruit juice to your water with 0-calorie NESFRUTA. It’s perfect on-the-go or at home. Refreshing, isn’t it? Add a splash of real fruit juice to your water with 0-calorie NESFRUTA. It’s perfect on-the-go or at home. Refreshing, isn’t it? These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/carnation-hot-chocolate",
    "title":"CARNATION Hot Chocolate | Canada’s #1 hot chocolate!",
    "text":"CARNATION Hot Chocolate gives families across Canada a warm hug. CARNATION Hot Chocolate gives families across Canada a warm hug.   Pets de sœur, literally translated as Nun farts,…and also known to some as “Croxignolles” is a French-Canadian dessert that is often made up from left over pie dough; at times from Tourtière. This quick and easy dessert was can be craft to avoid food waste and ensure that every last ingredient and bite is enjoyed and devoured. This take on a classic French-Canadian treat is rolled with an irresistible Carnation Hot Chocolate and cinnamon filling, then baked instead of fried. 20 mins. 20 mins. Create the perfect summer indulgent treat, frozen hot…chocolate. Simply blend with ice and milk, then enjoy! 3 mins. 0 mins.  13 mins. mins. Indulge in the ultimate chocolate lover's dream…with our decadent Kit Kat Whipped Hot Chocolate recipe. Sip, savour, and enjoy the blissful combination of creamy Carnation Hot Chocolate Whip Cream, rich and smooth Kit Kat spread, crunchy KitKat toppings and refreshing cold milk. Our Iced Kit Kat Whipped Hot Chocolate is the ultimate indulgence, perfect for any time of the year. Treat yourself to this delightful creation and let the flavours transport you to a world of chocolatey paradise. 3 mins. 0 mins. Our Mexican Hot Chocolate recipe combines the…smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip. 5 mins. 0 mins. Unleash your inner chocolatier and have a…blast preparing these indulgent treats. As you melt open the chocolate shell, be prepared to discover a hidden treasure of mini marshmallows, perfectly blended with the richness of Carnation Hot Chocolate and your favourite Nescafé. These mocha spheres offer a special moment to cozy up and treat yourself to a comforting and heavenly chocolatey experience. 5 mins. 10 mins. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/nesquik",
    "title":"Nesquik Syrups and Powders: Wake up your Milk!",
    "text":"NESQUIK® is a fun, easy and delicious way to enjoy all the nutritious benefits of milk. Simply squeeze it or scoop it and stir up a little fun! NESQUIK® is a fun, easy and delicious way to enjoy all the nutritious benefits of milk. Simply squeeze it or scoop it and stir up a little fun! These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/WOF-world-flavours",
    "title":"World of Flavours | Made with nestle",
    "text":"While we’ve all grown up with different cuisines and a world of flavours, we can always find a way to connect with others by sharing a meal together. Whether you’re enjoying traditional dishes from your own family or entertaining friends with a new recipe from a city across the world - food has the power to nourish and enlighten us about different cultures.    Thanks to our massive collection of recipes spanning more than 80 countries, we have a unique perspective into local food cultures and trends. In the spirit of celebrating Canada’s multiculturalism, we wanted to share some of our favourite recipes from around the globe so you can experience new cultures and maybe even be reminded of some familiar flavours. Indulge in a family-friendly, Filipino inspired treat…that’s as easy to whip up as it is delicious. These no-bake, bite-sized delights are ideal for summer days when you want to avoid turning on the oven. Made with the rich and chocolatey flavour of MILO, each piece is a sweet, chewy and creamy treat. 10 mins. 10 mins. Create the perfect summer indulgent treat, frozen hot…chocolate. Simply blend with ice and milk, then enjoy! 3 mins. 0 mins. A delicious way to celebrate Eid, our Matka Kulfi is…going to bring back nostalgic memories of strolling in the bazaar and sampling kulfi from a matka! 15 mins. 0 mins. Matcha green tea powder provides a punch of…healthy antioxidants. Combined with coconut, these bars become a decadent guiltless treat. 8 mins. 25 mins. Enjoy a whipped Strawberry or Chocolate Dalgona with…this simple recipe - only 2 ingredients required! 10 mins. 0 mins. Banana bread is studded with chunks of walnuts…and BOOSTed with protein powder for a great post-workout or midday snack. 10 mins. 65 mins. Mexican wedding cookies, also known as Polvorones,…are like a butter cookie with ground pecans. This cookie, which is actually enjoyed regularly in Mexico and other Latin countries, is even more delicious with added coffee flavour. 52 mins. 0 mins. The airy lightness of French meringue is beautifully…contrasted by the gooey, caramel-filled ROLO Mini pieces. This easy dessert recipe combines the classic French baking techniques of the meringue, with the comfort of a traditional chocolate chip cookie. 18 mins. 30 mins. Almond cookies are a cherished part of…Lunar New Year as they are considered a symbol of good fortune. We add a chocolatey KitKat crunch to our recipe, ensuring happiness all around! This easy recipe bakes up delicious almond scented cookies with a golden crackly shell and soft, crumbly interior, topped off with a piece of our irresistible KitKat Minis! 15 mins. 15 mins. Who says sweet and salty can't live together? Pairing…pretzels, peanuts and KIT KAT chocolate, these cookies provide historic flavour harmony with every bite. 13 mins. 15 mins. Korean short ribs, otherwise known as “galbi,” refers to…a strip of beef cut across the bone from the chuck end of the short ribs. Unlike American- and European-style short ribs, which include a thick slice of bone-in beef, Korean-style short ribs are cut lengthwise across the rib bone. The lengthwise cut helps to soak up the rich, Korean flavor–infused coffee marinade and serves to help grill it up quickly.           "
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipes\/original-smarties-cookies-recipe",
    "title":"The Original SMARTIES Cookies recipe",
    "text":"Did you know that SMARTIES are a Canadian-centered confectionery product? Try these yummy, chocolatey Canadian Cookies! A treat kids of all ages will love. Preheat oven to 375˚F (190˚C). In large bowl, beat softened butter and packed brown sugar with electric mixer until creamy. Beat in vanilla and eggs. Beat in flour, baking powder, and salt. Drop slightly rounded tablespoons about 2-inches (5 cm) apart onto greased baking sheets. Flatten cookies slightly and press 5 SMARTIES into top of each. Bake for 8 to 9 minutes. Preheat oven to 375˚F (190˚C). In large bowl, beat softened butter and packed brown sugar with electric mixer until creamy. Beat in vanilla and eggs. Beat in flour, baking powder, and salt. Drop slightly rounded tablespoons about 2-inches (5 cm) apart onto greased baking sheets. Flatten cookies slightly and press 5 SMARTIES into top of each. Bake for 8 to 9 minutes. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipes\/turtles-mason-jar-s%E2%80%99more-parfait",
    "title":"TURTLES Mason Jar S’more Parfait",
    "text":"Layer on the love with an indulgent treat that’s guaranteed to leave the whole family wanting s’more! Coat the bottom of each 250mL mason Jar with 3 tbsp. chocolate pudding. Add a 1 tbsp. layer of graham wafer crumbs. Layer on 1 roughly-chopped TURTLE. Add a layer of mini marshmallows and repeat until each glass is full. To really impress, toast the top layer of mini marshmallows and garnish with a whole TURTLE. (Optional) Feel like adding a little fresh fruit, or chopped nuts to your parfaits? Go wild! Mason jars not only look awesome, they’re a great way to take this treat with you. Picnic anyone? Coat the bottom of each 250mL mason Jar with 3 tbsp. chocolate pudding. Add a 1 tbsp. layer of graham wafer crumbs. Layer on 1 roughly-chopped TURTLE. Add a layer of mini marshmallows and repeat until each glass is full. To really impress, toast the top layer of mini marshmallows and garnish with a whole TURTLE. (Optional) Feel like adding a little fresh fruit, or chopped nuts to your parfaits? Go wild! Mason jars not only look awesome, they’re a great way to take this treat with you. Picnic anyone? These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipe\/green-monster-smoothie",
    "title":"Green Monster Smoothie Recipe with BOOST",
    "text":"Morning can be a monster, but it doesn’t have to be, by adding this easy recipe to your breakfast made with kale and BOOST® Nutrition Powder. In a blender, combine all ingredients and process until smooth. In a blender, combine all ingredients and process until smooth. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipes\/aero-truffle-tarts",
    "title":"AERO Truffle Tarts | Made with nestle",
    "text":"Tis the season for bubbly decadence! Place 1  chopped AERO Truffle Bar in a medium heatproof bowl. In a small saucepan over medium-high, heat cream until barely simmering. Immediately pour cream over chocolate. Add vanilla and let sit for 1 minute. Stir gently until mixture is smooth. Divide mixture between mini tart shells. Refrigerate until set, about 20 minutes. Garnish tarts with raspberries and chopped AERO Truffle. This recipe tastes great with an AERO Duo in place of the AERO Truffle. Try using a low fat whipping cream! Place 1  chopped AERO Truffle Bar in a medium heatproof bowl. In a small saucepan over medium-high, heat cream until barely simmering. Immediately pour cream over chocolate. Add vanilla and let sit for 1 minute. Stir gently until mixture is smooth. Divide mixture between mini tart shells. Refrigerate until set, about 20 minutes. Garnish tarts with raspberries and chopped AERO Truffle. This recipe tastes great with an AERO Duo in place of the AERO Truffle. Try using a low fat whipping cream! These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipes",
    "title":"Quick and Easy Recipes for Breakfast, Lunch and Dinner |Nestle recipes",
    "text":"Category Brand Products Time Clear All Treat yourself with this delicious twist on iced coffee! Our dalgona coffee recipe is easily made in 3 quick steps, then you can sit back, relax and enjoy A chilled tropical latte, sweetened with cane sugar This deliciously creamy espresso martini is the perfect mocktail to bond over. Unleash your inner chocolatier and have a blast preparing these indulgent treats. As you melt open the chocolate shell, be prepared to discover a hidden treasure of mini marshmallows, perfectly blended with the richness of Carnation Hot Chocolate and your favourite Nescafé. These mocha spheres offer a special moment to cozy up and treat yourself to a comforting and heavenly chocolatey experience. Our Mexican Hot Chocolate recipe combines the smooth and creamy texture of Carnation Hot Chocolate with a subtle kick of cayenne pepper and the comforting warmth of cinnamon. Whether you're seeking a cozy treat on a chilly evening or looking to add a touch of excitement to your hot chocolate routine, our Mexican Hot Chocolate recipe is the perfect choice. Grab your favorite mug and prepare to savour every sip. Indulge in the ultimate chocolate lover's dream with our decadent Kit Kat Whipped Hot Chocolate recipe. Sip, savour, and enjoy the blissful combination of creamy Carnation Hot Chocolate Whip Cream, rich and smooth Kit Kat spread, crunchy KitKat toppings and refreshing cold milk. Our Iced Kit Kat Whipped Hot Chocolate is the ultimate indulgence, perfect for any time of the year. Treat yourself to this delightful creation and let the flavours transport you to a world of chocolatey paradise. A rich, velvety caramel latte, with smooth, frothy milk and a hint of indulgent sweetness. This smooth iced classic sweetened with vanilla extract is the ultimate pick-me-up. The classic cappuccino, infused with the delicate, slightly sweet flavour of vanilla. Enjoy every sip with flair. Our maple pecan latte recipe combines sweet and nutty flavours for a delicious taste experience - not to mention it's super simple to make too! A chilled favourite of rich coffee sweetened with caramel. Oh so refreshing!"
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipe\/boost-fluffy-protein-pancake-waffle-mix",
    "title":"BOOST High Protein Berry Smoothie Bowl",
    "text":"A delicious, fruity snack featuring the complete nutrition of BOOST! Add all smoothie ingredients to a blender and blend until creamy and smooth. Taste and adjust flavor as needed. Divide between 4 serving bowls and top with desired toppings! For a lower sugar option, substitute with Boost Diabetic Strawberry (0.5g sugar vs 14g sugar in Boost High Protein) Customize your bowl by adding ingredients like roasted unsalted sunflower seeds, granola, raw or roasted nuts, shredded unsweetened coconut, fresh berries or hemp seeds. Best served fresh, though leftovers can be kept in jars in the fridge for up to 1-2 days. Add all smoothie ingredients to a blender and blend until creamy and smooth. Taste and adjust flavor as needed. Divide between 4 serving bowls and top with desired toppings! For a lower sugar option, substitute with Boost Diabetic Strawberry (0.5g sugar vs 14g sugar in Boost High Protein) Customize your bowl by adding ingredients like roasted unsalted sunflower seeds, granola, raw or roasted nuts, shredded unsweetened coconut, fresh berries or hemp seeds. Best served fresh, though leftovers can be kept in jars in the fridge for up to 1-2 days. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipe\/perfect-affogato-0",
    "title":"SMARTIES Perfectly Portable Pumpkin Pies",
    "text":"Celebrate fall with SMARTIES Perfectly Portable Pumpkin Pies. Lay out 4 mini-mason jars. Make the pumpkin layer by mixing the purée, brown sugar and cinnamon. Make the creamy layer by whipping the cream cheese in a mixer, then folding in the whipped topping. Spoon the ginger snap crumbs, the pumpkin layer and the creamy layer into the mini-mason jars, alternating layers. End with a dollop of the creamy layer, then garnish with crushed SMARTIES. Put a lid on the jars and head out on your fall adventure! Try using a low fat whipping cream! Sprinkle with cinnamon or nutmeg! Lay out 4 mini-mason jars. Make the pumpkin layer by mixing the purée, brown sugar and cinnamon. Make the creamy layer by whipping the cream cheese in a mixer, then folding in the whipped topping. Spoon the ginger snap crumbs, the pumpkin layer and the creamy layer into the mini-mason jars, alternating layers. End with a dollop of the creamy layer, then garnish with crushed SMARTIES. Put a lid on the jars and head out on your fall adventure! Try using a low fat whipping cream! Sprinkle with cinnamon or nutmeg! These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/en\/recipe\/cardamom-donuts-vanilla-bean-ice-cream",
    "title":"Cardamon donuts with vanilla bean ice cream",
    "text":"Combine flour, baking powder, salt, sugars, and spices in a bowl and whisk. In a separate bowl, combine milk, cream, melted butter, eggs, and extracts and blend. Add the milk mixture to the flour mixture until the dough comes together (more flour should be added if dough is too wet). Cover the dough with plastic wrap and let sit for 30 to 40 minutes. Place dough on floured surface and roll out to 1\/2\" thick. Lightly flour 2-1\/2\" round cookie cutter. Cut out round circles and set aside. Re-roll the scraps of dough to 1\/2\" thick and cut circles. Poke a hole in the center of each donut Fill a deep heavy pot with oil and turn on to high heat until oil reaches 350 degrees Fahrenheit. Line a baking pan with paper towels and set aside. Fry 3 to 4 donuts at a time. Turn the donuts until brown on each side. When brown, transfer donuts to lined baking pan. Let cool. Dust donuts with cardamom powdered sugar mixture. To serve, place one donut on a plate with one scoop of ice cream, then top with a drizzle of honey. Combine flour, baking powder, salt, sugars, and spices in a bowl and whisk. In a separate bowl, combine milk, cream, melted butter, eggs, and extracts and blend. Add the milk mixture to the flour mixture until the dough comes together (more flour should be added if dough is too wet). Cover the dough with plastic wrap and let sit for 30 to 40 minutes. Place dough on floured surface and roll out to 1\/2\" thick. Lightly flour 2-1\/2\" round cookie cutter. Cut out round circles and set aside. Re-roll the scraps of dough to 1\/2\" thick and cut circles. Poke a hole in the center of each donut Fill a deep heavy pot with oil and turn on to high heat until oil reaches 350 degrees Fahrenheit. Line a baking pan with paper towels and set aside. Fry 3 to 4 donuts at a time. Turn the donuts until brown on each side. When brown, transfer donuts to lined baking pan. Let cool. Dust donuts with cardamom powdered sugar mixture. To serve, place one donut on a plate with one scoop of ice cream, then top with a drizzle of honey. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipe\/raspberry-brown-butter-cr%C3%AApes-%C3%A0-la-mode",
    "title":"Raspberry Brown Butter Crêpes Recipe Ice Cream | Häagen Dazs Canada",
    "text":"Heat a non stick 5.5” frying pan on medium high heat. Melt the butter, swirling the pan until the butter starts to brown and smells nutty. Set aside. In the meantime, combine flour and sugar in a large bowl. Make a well, add the eggs and mix well. Slowly whisk the milk in, mixing until incorporated before pouring more. Add the brown butter and mix well. Cover with a tea towel and set aside. Set up your crepe station. Heat the frying pan you used to melt the butter on medium high heat. Have your bowl with the crepe batter and a ladle ready, as well as a plate to place the cooked crepes and a piece of foil to keep them warm. In a little bowl, pour the oil, and place a piece of paper towel in. Once ready, use the soaked paper towel to dab the pan with oil. This will allow you to have enough oil on the pan to cook the crepes, without frying them, which will make them lighter and fluffier. With a ladle, pour about 1\/4 of a cup of the crepe batter and swirl the pan, making sure that the batter covers all the surface. Cook for 1 minute and half to 2 minutes, flip and cook for an extra 30 seconds. Set aside on a plate, cover with foil. Repeat with the remaining oil and batter. To serve, place 3 crepes on a plate, scoop one scoop of HÄAGEN-DAZS® White Chocolate Raspberry Truffle Ice Cream, drizzle with the warm coulis and garnish with fresh raspberries.Enjoy immediately! Cook the crêpes on one side until they’re mostly done and then flip until done – the secret to keeping them soft and fluffy! Heat a non stick 5.5” frying pan on medium high heat. Melt the butter, swirling the pan until the butter starts to brown and smells nutty. Set aside. In the meantime, combine flour and sugar in a large bowl. Make a well, add the eggs and mix well. Slowly whisk the milk in, mixing until incorporated before pouring more. Add the brown butter and mix well. Cover with a tea towel and set aside. Set up your crepe station. Heat the frying pan you used to melt the butter on medium high heat. Have your bowl with the crepe batter and a ladle ready, as well as a plate to place the cooked crepes and a piece of foil to keep them warm. In a little bowl, pour the oil, and place a piece of paper towel in. Once ready, use the soaked paper towel to dab the pan with oil. This will allow you to have enough oil on the pan to cook the crepes, without frying them, which will make them lighter and fluffier. With a ladle, pour about 1\/4 of a cup of the crepe batter and swirl the pan, making sure that the batter covers all the surface. Cook for 1 minute and half to 2 minutes, flip and cook for an extra 30 seconds. Set aside on a plate, cover with foil. Repeat with the remaining oil and batter. To serve, place 3 crepes on a plate, scoop one scoop of HÄAGEN-DAZS® White Chocolate Raspberry Truffle Ice Cream, drizzle with the warm coulis and garnish with fresh raspberries.Enjoy immediately! Cook the crêpes on one side until they’re mostly done and then flip until done – the secret to keeping them soft and fluffy! These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipe\/snickerdoodle-cups-vanilla-ice-cream",
    "title":"Snickerdoodle Ice Cream Cups Recipe | Häagen Dazs Canada",
    "text":"Preheat the oven to 350F. In a large bowl, cream together butter and sugar until smooth. Beat in the egg, then stir in the vanilla. Sift in flour, cream of tartar, baking soda and salt until just blended. Form dough into a flat disc. If it is too soft to work with, cover with plastic wrap and chill in the refrigerator for 20 minutes up to one hour until firm. In a small plate, stir together sugar, cinnamon and ground apple rings if using.Roll dough out between two sheets of parchment paper to approximately a 1\/4” thick. Cut out 2.7” circles. You should get 16 to 18 circles. Drop each circle in the sugar and cinnamon mixture, ensure the surface is coated well. Place in a greased mini muffin tin. Repeat for each circle. Bake for 9 minutes. Cool for a couple of minutes on the cookie sheet before transferring to wire racks to cool completely. Once cooled, use a melon baller to scoop a portion of HÄAGEN-DAZS® Vanilla Bean Ice Cream, drizzle with caramel sauce and serve. As desired Caramel Sauce for drizzle You can use the off cuts of the dough to make extra cookies Preheat the oven to 350F. In a large bowl, cream together butter and sugar until smooth. Beat in the egg, then stir in the vanilla. Sift in flour, cream of tartar, baking soda and salt until just blended. Form dough into a flat disc. If it is too soft to work with, cover with plastic wrap and chill in the refrigerator for 20 minutes up to one hour until firm. In a small plate, stir together sugar, cinnamon and ground apple rings if using.Roll dough out between two sheets of parchment paper to approximately a 1\/4” thick. Cut out 2.7” circles. You should get 16 to 18 circles. Drop each circle in the sugar and cinnamon mixture, ensure the surface is coated well. Place in a greased mini muffin tin. Repeat for each circle. Bake for 9 minutes. Cool for a couple of minutes on the cookie sheet before transferring to wire racks to cool completely. Once cooled, use a melon baller to scoop a portion of HÄAGEN-DAZS® Vanilla Bean Ice Cream, drizzle with caramel sauce and serve. As desired Caramel Sauce for drizzle You can use the off cuts of the dough to make extra cookies These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipe\/sea-salt-chocolate-brownie-ice-cream-sandwiches",
    "title":"Chocolate Brownie Ice Cream Sandwiches Recipe | Häagen Dazs Canada",
    "text":"Preheat the oven to 350F.In a large bowl, cream together butter and sugar until smooth. Beat in the egg, then stir in the vanilla. In a large bowl; sift together flour, cocoa, baking soda, salt and cayenne pepper if using; stir into the creamed mixture until just blended. Measure 1 leveled tbsp of dough, roll it into a 1” ball in between your hands without applying too much pressure. Working in batches, place each ball at least 2 inches apart on a parchment lined baking sheet. Bake for 8 to 9 minutes. Once they are just out of the oven, sprinkle some coarse sea salt on each cookie. Cool for a couple of minutes on the cookie sheet before transferring to wire racks to cool completely. Once cooled, scoop some of your HÄAGEN-DAZS® Dulce De Leche Ice Cream and place it between 2 cookies. Press gently with both your palms so the cookies don’t break. If using, roll the sides of your cookies in chocolate shavings.Enjoy immediately or keep in the freezer for a week. ½ cup Dark Chocolate Shavings (optional) Preheat the oven to 350F.In a large bowl, cream together butter and sugar until smooth. Beat in the egg, then stir in the vanilla. In a large bowl; sift together flour, cocoa, baking soda, salt and cayenne pepper if using; stir into the creamed mixture until just blended. Measure 1 leveled tbsp of dough, roll it into a 1” ball in between your hands without applying too much pressure. Working in batches, place each ball at least 2 inches apart on a parchment lined baking sheet. Bake for 8 to 9 minutes. Once they are just out of the oven, sprinkle some coarse sea salt on each cookie. Cool for a couple of minutes on the cookie sheet before transferring to wire racks to cool completely. Once cooled, scoop some of your HÄAGEN-DAZS® Dulce De Leche Ice Cream and place it between 2 cookies. Press gently with both your palms so the cookies don’t break. If using, roll the sides of your cookies in chocolate shavings.Enjoy immediately or keep in the freezer for a week. ½ cup Dark Chocolate Shavings (optional) These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/recipe\/cardamom-donuts-vanilla-bean-ice-cream",
    "title":"Cardamon donuts with vanilla bean ice cream",
    "text":"Combine flour, baking powder, salt, sugars, and spices in a bowl and whisk. In a separate bowl, combine milk, cream, melted butter, eggs, and extracts and blend. Add the milk mixture to the flour mixture until the dough comes together (more flour should be added if dough is too wet). Cover the dough with plastic wrap and let sit for 30 to 40 minutes. Place dough on floured surface and roll out to 1\/2\" thick. Lightly flour 2-1\/2\" round cookie cutter. Cut out round circles and set aside. Re-roll the scraps of dough to 1\/2\" thick and cut circles. Poke a hole in the center of each donut Fill a deep heavy pot with oil and turn on to high heat until oil reaches 350 degrees Fahrenheit. Line a baking pan with paper towels and set aside. Fry 3 to 4 donuts at a time. Turn the donuts until brown on each side. When brown, transfer donuts to lined baking pan. Let cool. Dust donuts with cardamom powdered sugar mixture. To serve, place one donut on a plate with one scoop of ice cream, then top with a drizzle of honey. Combine flour, baking powder, salt, sugars, and spices in a bowl and whisk. In a separate bowl, combine milk, cream, melted butter, eggs, and extracts and blend. Add the milk mixture to the flour mixture until the dough comes together (more flour should be added if dough is too wet). Cover the dough with plastic wrap and let sit for 30 to 40 minutes. Place dough on floured surface and roll out to 1\/2\" thick. Lightly flour 2-1\/2\" round cookie cutter. Cut out round circles and set aside. Re-roll the scraps of dough to 1\/2\" thick and cut circles. Poke a hole in the center of each donut Fill a deep heavy pot with oil and turn on to high heat until oil reaches 350 degrees Fahrenheit. Line a baking pan with paper towels and set aside. Fry 3 to 4 donuts at a time. Turn the donuts until brown on each side. When brown, transfer donuts to lined baking pan. Let cool. Dust donuts with cardamom powdered sugar mixture. To serve, place one donut on a plate with one scoop of ice cream, then top with a drizzle of honey. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/unwrap-some-good",
    "title":"Unwrap Some Good 2025 | Made with nestle",
    "text":"Our vision for a brighter future The Nestlé Cocoa Plan was launched back in 2009. It has engaged close to 180 000 cocoa-farming families so far, building on our three pillars. Better farming, aiming to improve livelihoods in communities. Better lives, aiming to improve social conditions for families. And Better cocoa, aiming to improve product sustainability. Learn more about our approach to sustainably sourced cocoa Our vision for a brighter future The Nestlé Cocoa Plan was launched back in 2009. It has engaged close to 180 000 cocoa-farming families so far, building on our three pillars. Better farming, aiming to improve livelihoods in communities. Better lives, aiming to improve social conditions for families. And Better cocoa, aiming to improve product sustainability. Learn more about our approach to sustainably sourced cocoa As an innovative family-centered approach, the income accelerator program is aiming to close the living income gap and reduce child labor risks by encouraging changes in behavior and rewarding positive practices - both within the home and on the farm. The program rewards cocoa-farming families for practices that benefit the environment and local community. Learn more about The Income Accelerator Program.   These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/news\/smart-strategies-lose-weight-one-meal-time",
    "title":"How to Lose Weight, One Meal Plan at a Time | Boost Nutrition",
    "text":"When it comes to losing weight, there’s no miracle recipe or magic food that melts fat. So, to reach and maintain a healthy weight, you have to change your daily habits…for life! It takes a little effort, time, and perseverance. Simply by moving a little more every day and by trying some of the meal ideas below, you may not only slim your waistline, but you’ll improve your health and daily vitality. Since fruits and vegetables, as well as milk and milk-substitutes, are among the foods most under-consumed by Canadians,[1]make them a priority at snack-time. No matter what or when you eat, it is important to respect your hunger signals and your satiety. Eat only when your body needs to fuel up. And remember that fruits and vegetables should be the focus of your meals. They are very nutritious, so they should make up half of your plate. Meat should be the side dish to your vegetables, not the other way around!  This article has been sponsored by BOOST®, but all comments and opinions are my own. Julie DesGroseilliersRegistered DietitianRegistered Dietitian and nutritionist Julie DesGroseilliers holds a Bachelor of Nutrition and a Minor in Physical Activity Science from the Université de Montréal. She specializes in food communications and consumer education, and she regularly leads conferences on these topics.  She is also a published author of three books , including the bestseller “Bébé a faim.” A member of l’Union des artistes, she also occasionally appears across media such as radio, print, and television. [1]Statistics Canada. (2004). Canadian Community Health Survey Results. Overview of Canadians' Eating Habits. Retrieved from:http:\/\/www.statcan.gc.ca\/pub\/82-620-m\/82-620-m2006002-eng.htm(Accessed June 2, 2017)  These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/about-us",
    "title":"Nutritious and Delicious Choices and Recipes Made With Nestlé",
    "text":"We make meals and snacks that complement busy days, and warm sips to savour with slow moments. We also make nutrition solutions to help you through different life stages. We make it all with a drive to constantly improve our products and our company. Nutrition has always been at the heart of what we do. Our story began when Henri Nestlé developed the first milk-based baby formula for babies who were unable to feed from their mothers. His Farine Lactée formula actually saved the life of his neighbour’s premature baby. You might say he was an olden day hero! A lot has changed over the last 150 years. But our unwavering commitment to making good food hasn’t. But that’s just a teeny tiny part of what we do 40% Less Sugar! 4 flavours made with 5 simple (and simply delicious) ingredients No artificial flavours or colours here More good changes to come! Our favourite ingredient is care. Check out the sustainability story behind your favourite chocolate bars. We’ve donated over 1 Million bottles of water to communities affected by Natural disasters, dehydration and municipal water failures. Over the next 3 years, we’re helping 5,000 young Canadians develop their professional skills, grow their network, and increase their employability. Care to join us? All our employees are given day a year to volunteer. But many of us go way beyond! We are proud to work with all of these amazing organizations. Check out our latest news to see how we’re bringing Good Food, Good Life to your kitchen table, and the world! These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/nido",
    "title":"Toddler Nutritional Drink | Nestlé Nido® 1+",
    "text":"Need Help? Search About Nestlé Baby & me Stages Your child's development, every step of the way. Topics Find advice and answers to some of parenthood's biggest questions. Brands Explore nutritional brands that support you and your child’s overall growth and development. Products Discover our best nutritional offerings for you and your little one. Tools Enjoy all our parenting tools in one place. Quiz Join us Country - Language Breadcrumb You need tologinorregisterto add to your favorites. Nestlé NIDO 1+ Nutritional Toddler Drink is a milk-based everyday drink specially formulated to help support your child’s growth and development. Appropriate for toddlers 1 to 3 years NIDO®1+ Nutritional Toddler Drink provides a balance of essential nutrients to help support your little one’s normal immune system, bone development, and cognitive function. NIDO®1+ blends calcium, vitamin D, vitamin A, zinc, magnesium, probioticB. lactis, and DHA into a tasty toddler nutrition drink, making it easy for parents to complement their child’s diet with essential nutrients they need during this important stage of development. For over 70 years, moms around the world have chosen NIDO®nutritional milk-based beverages to help their kids grow and develop. Every second, 800 glasses of NIDO®are consumed around the world! Now available in Canada - NIDO 1+ is specially formulated to complement the nutritional needs of toddlers 1-3 years old. *Probiotic B. lactis helps maintain the specific natural digestive tract antibody immunoglobulin A (IgA) which may help support clinical outcomes of normal gut immune function †Primarily in children under 2 years old. ǂContains other sources of sugar. Skim milk powder, Sugars (corn maltodextrin, lactose), Palm olein, Vegetable oils (canola, sunflower), Galactooligosaccharides, Encapsulated tuna fish oil1[sugars (glucose), tuna fish oil, modified milk ingredients, dipotassium phosphate, mixed tocopherols, mono- and di-glycerides, silicon dioxide, sodium ascorbate], Oligofructose, Bifidobacterium lactis, Vitamins (vitamin A acetate, vitamin D3, DL-alpha-tocopheryl acetate, sodium ascorbate, thiamine mononitrate, riboflavin, niacinamide, calcium D-pantothenate, pyridoxine hydrochloride, folic acid, biotin), Minerals (tricalcium citrate, dipotassium phosphate, potassium citrate, magnesium chloride, ferrous sulphate, zinc sulphate, manganese sulphate, copper sulphate, potassium iodide), Soy lecithin. 1A source of docosahexaenoic acid (DHA). Product information is subject to change. Please refer to the product label or packaging for the most current nutrition and allergen information. Allergens Milk, Soy, Tuna. Your baby’s health depends on carefully following the directions for preparation and use. 01 02 03 See Preparation Instructions on pack for detailed instructions. Storage Close pack tightly after each use and store in a cool, dry place. Avoid extreme temperatures. Use within 4 weeks after opening. Customer reviews 4.6 Ratings What this fails to mention as this isn't a formula to be drank all day. If you read the can it's only suppose to be one a day as a nutrition supplement, not an all day formula like the rest. My baby transition from breast milk to other brand but he doesn’t like them, then i said why not try nido? And insaw they have for 1+.to my surprise my baby likes it. Hopefully it helps him to gain more weight Related products Gerber®Multigrain Cherries & Berries Toddler Cereal (Add Water) Introduce new flavours and textures to baby as they grow with the next stage of GERBER cereals! For toddlers 12 months and up. Related tools Product finder Find Nestlé Nutrition Products right for you and your baby Join Your parenting instincts, our support SIGN UP & GET A CHANCE TO WIN Sign up for Nestlé Baby & me and automatically be entered for a chance to win a $100* gift card! For full details, please visit theTerms & Conditions. PERSONALIZED EMAILS & SUPPORT Receive customized emails with useful info, special offers, & more to help guide you through each parenting phase. HELPFUL TOOLS & RESOURCES Get access to our helpful and interactive parenting tools & resources in one convenient hub. EXPERT GUIDANCE We offer science-based advice & specialized nutritional guidance for every stage of the parenting journey—from preconception to toddlerhood. Still haven't found what you are looking for? Enjoy experts advice, exclusive offers and more! Discover your tailored content. Define your interests and access to your personalized contents page. Looking for inspiration on what to feed your little one? These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/perrier",
    "title":"Perrier Sparkling Natural Spring Water | Perrier Canada",
    "text":"A COCKTAIL FOR ANY MOOD These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/coffee",
    "title":"404 | Made with Nestlé | Nestlé Canada",
    "text":"Sounds like a perfect excuse to take a lil' break.Take an even longer break withthis whole pageof KIT KATS. He stole the page you were looking for from right under your nose!Luckily, he left behind this mug ofNESCAFÉfor you to sip on.Or at least look at. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/coffee-mate-liquid",
    "title":"Coffee Mate Liquid | Made with nestle",
    "text":"These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/easy-to-prepare-foods",
    "title":"404 | Made with Nestlé | Nestlé Canada",
    "text":"Sounds like a perfect excuse to take a lil' break.Take an even longer break withthis whole pageof KIT KATS. He stole the page you were looking for from right under your nose!Luckily, he left behind this mug ofNESCAFÉfor you to sip on.Or at least look at. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/help",
    "title":"Support Hub Homepage | Made With Nestlé Canada",
    "text":"We'd love to hear from you! We always appreciate feedback from our valuable consumers. Please contact us with your questions, concerns or compliments. We have the answers to your most common questions including: composition, allergens, certifications, ingredients, packaging, preparation, storage, manufacturing locations, recycling, availability, discontinuations, where to buy or coupons and promotions . Learn more here."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/signup-1",
    "title":"Sign up | Made with Nestle | Nestlé Canada",
    "text":"Become a member today and get even closer to brands you love.  Discover exclusive coupons, contests, giveaways and more!   These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/quality-street#products",
    "title":"QUALITY STREET | Imported Chocolates & Caramels",
    "text":"Celebrate with a tin full of tradition. QUALITY STREET is a decadent mix of imported chocolates and caramels that will delight your friends and family. Celebrate with a tin full of tradition. QUALITY STREET is a decadent mix of imported chocolates and caramels that will delight your friends and family. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/quality-street#facts",
    "title":"QUALITY STREET | Imported Chocolates & Caramels",
    "text":"Celebrate with a tin full of tradition. QUALITY STREET is a decadent mix of imported chocolates and caramels that will delight your friends and family. Celebrate with a tin full of tradition. QUALITY STREET is a decadent mix of imported chocolates and caramels that will delight your friends and family. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/diwali",
    "title":"Diwali | Made with Nestlé | Nestlé Canada",
    "text":"Whether you are exchanging gifts, lighting diyas, or decorating your home, we have some simple recipes you can serve your friends and family to celebrate the festival of lights. Whether you are exchanging gifts, lighting diyas, or decorating your home, we have some simple recipes you can serve your friends and family to celebrate the festival of lights. Our decadent Nankhatai are imbued with the…irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. 15 mins. 20 mins. Burfi (also known as barfi) is a popular dessert that is…commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence 15 mins. 15 mins. Perfect for Iftar, this cake is rich with dates that restore…energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! 15 mins. 30 mins. These milky, sweet, and delicious frozen treats are…sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. 10 mins. 30 mins. Add a special sparkle to your Diwali celebrations with…S.PELLEGRINO Naturali Limonata Chatpati Shikanji! Treat yourself and your guests to this zesty mix of ginger, mint, spice and lemon that will linger on your palate sip after sip. S. Pellegrino Limonata enhances this drink with its refreshing and bright flavours made with carefully selected Sicilian lemons. 10 mins. 0 mins. A deliciously different way to prepare sabzi, our Subz…Mast Masala makes dinner prep easy, thanks to MAGGI Tamarina Sauce and MAGGI Masala Chilli Sauce. You don’t have to add any masalas, just add your favourite vegetables to this spicy roasted medley and watch your family savour this vegetarian dish that is crispy, tasty, and mast all at once! 15 mins. 30 mins. A delicious way to celebrate Eid, our Matka Kulfi is…going to bring back nostalgic memories of strolling in the bazaar and sampling kulfi from a matka! 15 mins. 0 mins. Biryani or your favourite MAGGI Masala Noodles?…Now you don't have to choose. This epic MAGGI Noodles Biryani Recipe combines your favourite 2-Minute Masala Noodles with a Biryani twist. Packed with lots of vegetables and aromatic spices, this easy and delicious meal will be a hit with the whole family. It can be served at home for everyday cooking or for special occasions like holidays and celebrations. 15 mins. 40 mins. Besan laddoo (Besan ke laddu)  is a popular sweet…dish made of besan (chickpea flour or gram flour), sugar, and ghee. The secret of these irresistible sweet balls full of flavor lies in the careful preparation of the right ingredients. Besan laddoos are often served during religious festivals. Try them for Diwali! "
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/sustainable-cocoa-sourcing",
    "title":"Unwrap Some Good 2025 | Made with nestle",
    "text":"Our vision for a brighter future The Nestlé Cocoa Plan was launched back in 2009. It has engaged close to 180 000 cocoa-farming families so far, building on our three pillars. Better farming, aiming to improve livelihoods in communities. Better lives, aiming to improve social conditions for families. And Better cocoa, aiming to improve product sustainability. Learn more about our approach to sustainably sourced cocoa Our vision for a brighter future The Nestlé Cocoa Plan was launched back in 2009. It has engaged close to 180 000 cocoa-farming families so far, building on our three pillars. Better farming, aiming to improve livelihoods in communities. Better lives, aiming to improve social conditions for families. And Better cocoa, aiming to improve product sustainability. Learn more about our approach to sustainably sourced cocoa As an innovative family-centered approach, the income accelerator program is aiming to close the living income gap and reduce child labor risks by encouraging changes in behavior and rewarding positive practices - both within the home and on the farm. The program rewards cocoa-farming families for practices that benefit the environment and local community. Learn more about The Income Accelerator Program.   These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/aerobubblebeat",
    "title":"NESTLÉ AERO “BUBBLE TO YOUR OWN BEAT” CONTEST | Made with nestle",
    "text":"These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/quality-street\/quality-street-holiday-gift-tin",
    "title":"QUALITY STREET Holiday Gift Tin | Made with nestle",
    "text":"Celebrate with NESTLÉ QUALITY STREET! A Canadian favourite for over 75 years, QUALITY STREET'S decadent mix of chocolates and candies is a Canadian tradition. With treats like Truffle Block, Toffee Penny, Orange Créme, Hazelnut Flavoured Triangle, Coconut Éclair, Caramel Cup, Hazelnut in Caramel, Fudge, Strawberry Créme, Orange Crunch, and Toffee Finger, QUALITY STREET is sure to delight. Our beautifully designed collectible tin is ready for gift-giving or sharing with friends and family. Imported from England, QUALITY STREET's candies and chocolates are made with no artificial flavours using cocoa that is 100% Rainforest Alliance certified, which helps farmers improve the quality of their products and strengthen their communities. Enjoy QUALITY STREET candies and chocolates and open a tin full of tradition! Celebrate The Holidays: Delight your friends and family with QUALITY STREET's assorted chocolates and candies A Canadian Favourite For Over 75 Years: QUALITY STREET's decadent mix of milk chocolates, dark chocolates, crémes, toffees, and pralines are a Canadian tradition Ready For Gifting: Comes in a beautifully designed collectible tin, perfect for giving as a gift or sharing with friends and family No Artificial Flavours: NESTLÉ QUALITY STREET chocolates and candies are made with all natural flavours Individually Wrapped: QUALITY STREET chocolates and candies are individually wrapped Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, we purchase 100% Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities Sugars (sugar, glucose-fructose, sweetened condensed milk), Modified milk ingredients, Palm, vegetable and coconut oils, Unsweetened chocolate*, Cocoa butter*, Dried coconut, Butter, Hazelnuts, Sunflower and\/or rapeseed lecithin, Cocoa powder*, Salt, Monoglycerides, Lactic acid, Citric acid, Natural flavour.May contain: Peanuts, Other tree nuts.*Rainforest Alliance Certified These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/quality-street\/quality-street-holiday-gift-box",
    "title":"QUALITY STREET Holiday Gift Box | Made with nestle",
    "text":"Celebrate the holidays with NESTLÉ QUALITY STREET! A Canadian favourite for over 75 years. With treats like Truffle Block, Toffee Penny, Orange Créme, Hazelnut Flavoured Triangle, Coconut Éclair, Caramel Cup, Hazelnut in Caramel, Fudge, Strawberry Créme, Orange Crunch, and Toffee Finger, QUALITY STREET is sure to delight. Quality Street gift boxes are the perfect choice for gift-giving or sharing with friends and family. Containing all of your favourite bright, colourful sweets. Imported from England, QUALITY STREET's candies are made with no artificial flavours using cocoa that is 100% Rainforest Alliance certified, which helps farmers improve the quality of their products and strengthen their communities. Enjoy QUALITY STREET assorted candies this holiday season and open a bag full of tradition! Celebrate The Holidays: Delight your friends and family with QUALITY STREET's assorted chocolates and candies A Canadian Favourite For Over 75 Years: QUALITY STREET's decadent mix of milk chocolates, dark chocolates, crémes, toffees, and pralines are a Canadian tradition Ready For Gifting: Comes in a beautifully designed gift box, perfect for giving as a gift or sharing with friends and family No Artificial Flavours: NESTLÉ QUALITY STREET chocolates and candies are made with all natural flavours Individually Wrapped: QUALITY STREET chocolates and candies are indiviudally wrapped Rainforest Alliance Certified: As part of the NESTLÉ Cocoa Plan, we purchase 100% Rainforest Alliance certified cocoa which helps farmers improve the quality of their products and strengthen their communities Ingredients: Sugars (sugar, glucose-fructose, sweetened condensed milk), Modified milk ingredients, Palm, vegetable and coconut oils, Unsweetened chocolate*, Cocoa butter*, Dried coconut, Butter, Hazelnuts, Sunflower and\/or rapeseed lecithin, Cocoa*,  Natural flavour, Salt, Monoglycerides, Lactic acid, Citric acid.May contain: Peanuts, Other tree nuts. *Rainforest Alliance Certified These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/quality-street\/quality-street-bag",
    "title":"QUALITY STREET Share Bag | Made with nestle",
    "text":"Celebrate the holidays with NESTLÉ QUALITY STREET! A Canadian favourite for over 75 years. With treats like Truffle Block, Toffee Penny, Orange Créme, Hazelnut Flavoured Triangle, Coconut Éclair, Caramel Cup, Hazelnut in Caramel, Fudge, Strawberry Créme, Orange Crunch, and Toffee Finger, QUALITY STREET is sure to delight. Quality Street boutique bags are the perfect choice for gift-giving or sharing with friends and family. Containing all of your favourite bright, colourful sweets. Imported from England, QUALITY STREET's candies are made with no artificial flavours using cocoa that is 100% Rainforest Alliance certified, which helps farmers improve the quality of their products and strengthen their communities. Enjoy QUALITY STREET assorted candies this holiday season and open a bag full of tradition! A superior assortment of caramels, crèmes, and pralines imported from England This boutique bag makes for exceptional treats to share with family and friends Individually wrapped in colourful wrappers  Perfect for gifting Sugars (Sugar, Glucose-Fructose, Sweetened Condensed Milk), Modified Milk Ingredients, Unsweetened Chocolate*, Cocoa Butter*, Palm, Coconut and Vegetable Oils, Coconut, Hazelnuts, Sunflower Lecithin, Mono and Di-Glycerides, Natural Flavour, Cocoa Powder*, Salt, Glycerol, Lactic Acid, Citric Acid. *Rainforest Alliance Certified. These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These milky, sweet, and delicious frozen treats are sure please everybody’s taste buds! Add cardamom, chocolate, coconut or coffee for a little extra flavour. Burfi (also known as barfi) is a popular dessert that is commonly served to celebrate a special occasion, such as a wedding or gathering, and throughout the Diwali festival! This delicious, fudge-like dessert can be made with a variety of toppings and flavourings (such as nuts, spices and floral essences like rose water or saffron). This rendition is made with creamy coconut milk and studded with decadent chocolate for the ultimate holiday indulgence Our decadent Nankhatai are imbued with the irresistible aroma of cardamom, caramel, and chocolate! QUALITY STREET Sweets make these Nankhatai unique as no two cookies taste the same! Serve these golden brown cookies with a cup of chai to your guests while they are still soft, gooey and warm from the oven! These Nankhatai cookies are the perfect celebration treat for Diwali and the holiday season. Perfect for Iftar, this cake is rich with dates that restore energy after a day of fasting. The chocolates add a wonderful depth and flavour to this cake! These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/quality-street\/quality-street-small-tin",
    "title":"QUALITY STREET | Imported Chocolates & Caramels",
    "text":"Celebrate with a tin full of tradition. QUALITY STREET is a decadent mix of imported chocolates and caramels that will delight your friends and family. Celebrate with a tin full of tradition. QUALITY STREET is a decadent mix of imported chocolates and caramels that will delight your friends and family. These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  },
  {
    "url":"https:\/\/www.madewithnestle.ca\/sitemap",
    "title":"Site Map | Nestlé Canada | Made With Nestlé Canada",
    "text":"These cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information. These cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance. These cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly. These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising. These cookies are set by a range of social media services that we have added to the site to enable you to share our content with your friends and networks. They are capable of tracking your browser across other sites and building up a profile of your interests. This may impact the content and messages you see on other websites you visit. If you do not allow these cookies you may not be able to use or see these sharing tools."
  }
]